## Pandas

## Boolean

In [3]:
True

True

In [5]:
True == True

True

In [7]:
True == 1

True

In [8]:
True == 0

False

In [10]:
True == '1'

False

In [12]:
True == False

False

In [15]:
True != 0

True

In [16]:
False == 0

True

In [17]:
True or False

True

In [19]:
1 == '1'

False

In [21]:
(19*55)*3 > 90

True

In [24]:
eng = 'Korea COVID 19'

In [26]:
eng.lower()

'korea covid 19'

In [31]:
eng.upper()

'KOREA COVID 19'

In [38]:
list_data=[1,2,3,4,5]
tuple_data=(1,2,3,4,5)
dic_data = {1:100,2:200,3:300,4:400,5:500}

In [40]:
type(list_data),type(tuple_data),type(dic_data)

(list, tuple, dict)

In [43]:
list_data = '마지막'

In [44]:
tuple_data[2] = '가운데'

TypeError: 'tuple' object does not support item assignment

In [46]:
data = []
data.append('java')
data[0], data[-1],data[1:],data[:2]
data.sort()
data.reverse()

In [57]:
data

['java']

In [59]:
data=[]
data.append('good')

In [60]:
data.append('java')

In [61]:
data.append('cobold')

In [62]:
data.append('old')

In [63]:
data.reverse()
data

['old', 'cobold', 'java', 'good']

In [65]:
data.sort()
data

['cobold', 'good', 'java', 'old']

In [75]:
dic = {100:'뭐지..',200:'우와','우마우마':'대단',400:'레게노',500:'사이다'}

In [81]:
dic[100],dic[200],dic['우마우마']

('뭐지..', '우와', '대단')

In [93]:
dict.values()

TypeError: descriptor 'values' of 'dict' object needs an argument

In [94]:
man = [1,2,3]
man

In [96]:
import pandas as pd
pd.DataFrame(man)

   0
0  1
1  2
2  3

In [98]:
b = [4,5,6]
b

[4, 5, 6]

In [102]:
import pandas as pd
pd.DataFrame(data=dict(num = man, sum = b), index=['a','b','c'])

   num  sum
a    1    4
b    2    5
c    3    6

In [109]:
man = [{'num':[1,2,3]},{'sum':[4,5,6]}]

In [111]:
pd.DataFrame(man)

         num        sum
0  [1, 2, 3]        NaN
1        NaN  [4, 5, 6]

In [113]:
man = [
    {'num':1, 'sum':4},
    {'num':2, 'sum':5},
    {'num':3, 'sum':6}
]

In [115]:
pd.DataFrame(man)

   num  sum
0    1    4
1    2    5
2    3    6

In [124]:
person = {
    'name':['a','b','b','d'],
    '국어':[100,17,60,50],
    '영어':[40,58,64,89]
}

In [127]:
df = pd.DataFrame(person)

In [128]:
df

  name   국어  영어
0    a  100  40
1    b   17  58
2    b   60  64
3    d   50  89

In [129]:
df['국어']

0    100
1     17
2     60
3     50
Name: 국어, dtype: int64

In [133]:
pr = {
    'C':[10,10,10,10,10],
    'P':[10,10,10,10,10],
    'J':[10,10,10,10,10]
}

In [135]:
pd.DataFrame(pr,index=['1교시','2교시','3교시','4교시','5교시'])

      C   P   J
1교시  10  10  10
2교시  10  10  10
3교시  10  10  10
4교시  10  10  10
5교시  10  10  10